/*
 * Тестирование работы mystem
 */
var Mystem = require("./../modules/utils/mystem").Mystem;
var Stem = require("./../modules/models/stem").Stem;

var params =  {
    text: "Решением Арбитражного суда города Москвы от 14.04.2011 г. по настоящему делу с ОАО «Центр аварийно-спасательных и экологических операций» в пользу заявителя было взыскано 233.000 руб., в том числе: 220.000 руб. неустойки, 13.000 руб. судебных расходов по уплате государственной пошлины. В удовлетворении остальной части заявленных требований судом было отказано. Решение вступило в законную силу, истцом получен исполнительный лист серии АС № 00276398.",
    category: "3c46c4cb-b820-4f8d-8740-15fc744a05a8"
}

Stem.steming(params, function(){
    console.log("ok")
})
