/* 
 * Тестирование документа
 */


var Document = require("./../modules/models/document").Document;

var document = new Document({
   id: 2154878812212711232,
   name : "Агентирование - Неисполнение или ненадлежащее исполнение обязательств", 
   category : "1c46c4cb-b820-4f8d-8740-15fc744a05a8",
   date: "20.02.2012",
   text: "Решением Арбитражного суда города Москвы от 14.04.2011 г. по настоящему делу с ОАО «Центр аварийно-спасательных и экологических операций» в пользу заявителя было взыскано 233.000 руб., в том числе: 220.000 руб. неустойки, 13.000 руб. судебных расходов по уплате государственной пошлины. В удовлетворении остальной части заявленных требований судом было отказано. Решение вступило в законную силу, истцом получен исполнительный лист серии АС № 00276398.",
    
   end: function(doc) {
       console.log("End");
   }
});